erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpedt.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c10085b0-8e5e-4fae-894b-5098ccc2ad7c">
      <name>ПроконтролироватьКачество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5665e096-98e9-4c26-9342-25c72b7b133b">
      <name>ДатаПодтвержденияКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpedt.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/СМ_СканРО/Module.bsl
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыМС(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСканРО(Команда)
		ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтотОбъект.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		ППараметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыМС", ЭтотОбъект);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_Форма", ППараметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Элементы.ДекорацияОшибка.Заголовок = "";	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьСканРО();
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура ТаблицаТоваровПриАктивизацииСтроки(Элемент)
	# Если МобильныйКлиент Тогда
 	Если Элемент.ТекущиеДанные.Принять = Ложь тогда
		Элемент.ТекущиеДанные.Принять = Истина;
	Иначе
		Элемент.ТекущиеДанные.Принять = Ложь;
	КонецЕсли;		
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле <> Неопределено  Тогда
		//ВЗнач	= Неопределено;
		//Если ВвестиЗначение(ВЗнач, "Выберите магазин", Тип("СправочникСсылка.Склады")) Тогда
		//	ТД = Объект.ТоварыКДоставке[ВыбраннаяСтрока];
		//	ТД.АдресИсточник	= ВЗнач;
		//КонецЕсли;
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура Принять(Команда)
	РезультатСервера  = ПринятьНаСервере();
	
	Если НЕ РезультатСервера.Успех Тогда 
		//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		//ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	Иначе	
		ГруппаДокументаВидимость(Ложь)       ; 
		ГруппаШапка(Истина);    

		
		АктивироватьСканРО();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаШапка(Видимость)
	Элементы.ГруппаШапка.Видимость = Видимость;	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаДокументаВидимость(Видимость)
	Элементы.ГруппаДокумента.Видимость = Видимость;	
КонецПроцедуры

&НаСервере
Функция ПринятьНаСервере()     
	Перем Результат;
	
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");
	
	Док = ЭтотОбъект.ДокРО.ПолучитьОбъект();
	ДокПР = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ДокПР.Дата = ТекущаяДата();
	ДокПР.Склад = Док.Получатель;//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции") ; 
	ДокПР.Отправитель = Док.Склад;
	ДокПР.Распоряжение = Док.ТоварыПоРаспоряжениям[0].Распоряжение; 
	ДокПР.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;  //КПоступлению
	ДокПР.ДатаВходящегоДокумента = ТекущаяДата();

	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокПР.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению; 
	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.Исполнитель = ЭтаФорма.Сотрудник;
	
	ТабТ =  ТаблицаТоваров.Выгрузить();
	ПараметрыОтбора = Новый Структура("Принять",Истина);
	ТабТН = ТабТ.Скопировать(ПараметрыОтбора);
	
	Для Каждого стр из ТабТН Цикл 
		НовСтр = ДокПР.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
		Если стр.СтатусУказанияСерий = 14 Тогда
			НовСтр.СтатусУказанияСерий = 4;
		КонецЕсли;
	КонецЦикла;
	
	Попытка 
		ДокПР.Записать(РежимЗаписиДокумента.Проведение); 
	
		Док.СХК_ПринятТСД = Истина;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Успех = Истина;
	Исключение 
		ДокПР.Записать(РежимЗаписиДокумента.Запись);
		Результат.ТекстОшибки = "Документ Приходный Ордер На Товары не записан";	
		
	КонецПопытки;
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЗаполнитьТаблицуТоваровПоРО(Текст);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваровПоРО(УИД)
	
	Элементы.ДекорацияОшибка.Заголовок = "";	
	ТаблицаТоваров.Очистить(); 
	
	Идентификатор = Новый УникальныйИдентификатор(УИД);
	ЭтотОбъект.ДокРО = Обработки.СХК_МобильныйСклад.НайтиРО(УИД).Ссылка;
	
	Если Не ДокРО.Пустая() И ДокРО.Проведен Тогда
		Если ДокРО.СХК_ПринятТСД = Истина Тогда
			ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
			Элементы.ДекорацияОшибка.Заголовок = "Документ уже принят";	
		Иначе
			ТаблицаТоваров.Загрузить(ДокРО.ОтгружаемыеТовары.Выгрузить());
			Элементы.ГруппаДокумента.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		Элементы.ДекорацияОшибка.Заголовок = "Документ не найден";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканРО() Экспорт 

	ЭтотОбъект.Элементы.СканQR.РедактированиеТекста = Истина;
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры
